using Microsoft.EntityFrameworkCore;
using MovieDiscovery.Server.Models;

namespace MovieDiscovery.Server.Context
{
    /// <summary>
    /// Контекст бази даних для роботи з застосунком Movie Discovery.
    /// </summary>
    /// <param name="dbContext">Конфігураційні параметри контексту бази даних.</param>
    public class MovieDBContext(DbContextOptions<MovieDBContext> dbContext) : DbContext(dbContext)
    {
        /// <summary>
        /// Колекція фільмів у базі даних.
        /// </summary>
        public DbSet<Movie> Movies { get; set; }

        /// <summary>
        /// Колекція жанрів у базі даних.
        /// </summary>
        public DbSet<Genre> Genres { get; set; }

        /// <summary>
        /// Колекція зв’язків між фільмами та жанрами.
        /// </summary>
        public DbSet<Movie_Genre> Movies_Genres { get; set; }

        /// <summary>
        /// Колекція користувачів у базі даних.
        /// </summary>
        public DbSet<User> Users { get; set; }

        /// <summary>
        /// Заповнення початковими даними та налаштування моделей.
        /// </summary>
        /// <param name="modelBuilder">Об'єкт для конфігурації моделі.</param>
        protected override void OnModelCreating(ModelBuilder modelBuilder)
        {
            modelBuilder.Entity<User>()
            .HasMany(u => u.MoviesGenres)
            .WithOne(m => m.User)
            .HasForeignKey(mg => mg.UserId)
            .OnDelete(DeleteBehavior.SetNull);

            modelBuilder.Entity<Genre>().HasData(
                new Genre { Id = 1, Name = "Фентезі" },
                new Genre { Id = 2, Name = "Музичні" },
                new Genre { Id = 3, Name = "Мелодрами" },
                new Genre { Id = 4, Name = "Сімейний" },
                new Genre { Id = 5, Name = "Дитячий" },
                new Genre { Id = 6, Name = "Екшн" },
                new Genre { Id = 7, Name = "Комедія" },
                new Genre { Id = 8, Name = "Пригоди" }
            );

            modelBuilder.Entity<Movie>().HasData(
                new Movie
                {
                    Id = 1,
                    Title = "Чародійка",
                    Description = "Фільм розповідає нерозказану історію Ельфаби, майбутньої Злої Відьми Заходу, та її складних стосунків з Гліндою, Доброю Відьмою Півночі. Оповідь розгортається переважно до прибуття Дороті в країну Оз, досліджуючи, як Ельфаба, народжена із зеленою шкірою і лютим духом, стає незрозумілою і врешті-решт отримує ярлик «злої».\r\n\r\nФільм заглиблюється в подорож Ельфаби від її дитинства до навчання в університеті Шиз, де вона знайомиться з Гліндою, популярною та привілейованою дівчиною. Їхню дружбу випробовують контрастні характери та ідеології, суперництво за чарівного принца Фієро та їхня реакція на деспотичний режим Чарівника країни Оз. У міру того, як Ельфаба дедалі більше усвідомлює корумпованість влади Чарівника і бореться проти несправедливості, темні таємниці та особисті трагедії формують її шлях до того, щоб стати культовою фігурою, відомою як Зла Відьма.",
                    Year = 2024,
                    Rating = 7.6f
                },
                new Movie
                {
                    Id = 2,
                    Title = "Барбі",
                    Description = "У Барбіленді, матріархальному суспільстві з різними Барбі, Кенами та вигнанцями, Кен прагне тіснішого зв'язку з Барбі, яка зосереджена на своїй кар'єрі. Коли Барбі стикається з екзистенційною кризою, вона розуміє, що для зцілення їй необхідно знайти свого реального власника. Кен приєднується до неї, і їхня подорож приводить їх до Саші, дівчини, яка критично ставиться до стандартів краси Барбі.\r\n\r\nПовернувшись до Барбіленду, Кен захоплює владу, запроваджуючи патріархальну систему. Подруга Барбі Глорія допомагає їй і Саші вирватися з-під влади \"Маттел\". Разом вони згуртовують Барбі, щоб звільнитися від підпорядкування і відновити баланс.",
                    Year = 2023,
                    Rating = 6.8f
                },
                new Movie
                {
                    Id = 3,
                    Title = "Школа монстрів: 13 бажань",
                    Description = "Улюблені героїні \"Школи монстрів\" опиняються у вирі надприродних подій. Коли Френкі Стайн знаходить таємничий ліхтар джина, вона та її друзі мимоволі вивільняють силу бажань у своєму світі. Коли їхні бажання здійснюються, вони незабаром усвідомлюють, що їхні мрії мають непередбачувані наслідки і загрожують порушити рівновагу в їхній школі, наповненій монстрами.\r\n\r\nЗгодом учні мають пройти через низку випробувань, подолати власні страхи та невпевненість і, зрештою, зрозуміти важливість безкорисливості та вибору на користь більшого блага. Працюючи разом, вони відкривають для себе справжнє значення дружби і знаходять сили, щоб виправити хаос, який вони спричинили.",
                    Year = 2013,
                    Rating = 6.9f
                },
                new Movie
                {
                    Id = 4,
                    Title = "Школа монстрів: Бу Йорк, Бу Йорк",
                    Description = "Монстри з Монстр Хай вирушають у захопливу подорож до міста Бу-Йорк, де вони відвідують історичне свято Кришталевої комети. Дорогою вони дізнаються про змову з метою викрасти магічну силу комети та спричинити хаос у місті. За допомогою нових друзів та своїх унікальних здібностей монстри мають розгадати таємницю, врятувати комету та показати світові, що бути інакшим - це не лише нормально, але й те, що варто святкувати. Цей анімаційний фільм, наповнений яскравими музичними номерами та моторошними пригодами, оспівує дружбу, самоприйняття та силу єдності.",
                    Year = 2015,
                    Rating = 6.7f
                },
                new Movie
                {
                    Id = 5,
                    Title = "Школа монстрів: Привиди",
                    Description = "\"Монстр Хай: Привиди\" - анімаційний фільм, що розповідає про пригоди групи учениць \"Монстр Хай\", які розслідують справу про привидів у місцевому історичному театрі. По дорозі вони натрапляють на таємничого привида, який, схоже, пов'язаний з минулим \"Монстр Хай\".\r\nСюжет наповнений інтригою, гумором і музичними номерами, які неодмінно сподобаються як дітям, так і дорослим.\r\nШанувальники франшизи \"Монстр Хай\" будуть у захваті, побачивши, як їхні улюблені персонажі, такі як Дракулаура та Вовк Клаудін, приймають нові виклики та зростають як особистості.\r\nЗагалом, \"Монстр Хай: Привиди\" - це веселий фільм, який оспівує дружбу, хоробрість і прийняття відмінностей, а також надає моторошних відчуттів і хвилювань.",
                    Year = 2015,
                    Rating = 6.3f
                }
            );

            modelBuilder.Entity<Movie_Genre>().HasData(
                new Movie_Genre { Id = 1, MovieId = 1, GenreId = 1, UserId = null },
                new Movie_Genre { Id = 2, MovieId = 1, GenreId = 2, UserId = null },
                new Movie_Genre { Id = 3, MovieId = 1, GenreId = 3, UserId = null },
                new Movie_Genre { Id = 4, MovieId = 2, GenreId = 3, UserId = null },
                new Movie_Genre { Id = 5, MovieId = 2, GenreId = 6, UserId = null },
                new Movie_Genre { Id = 6, MovieId = 2, GenreId = 7, UserId = null },
                new Movie_Genre { Id = 7, MovieId = 2, GenreId = 8, UserId = null },
                new Movie_Genre { Id = 8, MovieId = 3, GenreId = 1, UserId = null },
                new Movie_Genre { Id = 9, MovieId = 3, GenreId = 5, UserId = null },
                new Movie_Genre { Id = 10, MovieId = 3, GenreId = 7, UserId = null },
                new Movie_Genre { Id = 11, MovieId = 4, GenreId = 2, UserId = null },
                new Movie_Genre { Id = 12, MovieId = 4, GenreId = 5, UserId = null }
            );
        }
    }

}
