using api.Models;
using Microsoft.EntityFrameworkCore;

namespace api.Context
{
    public class MovieDBContext(DbContextOptions<MovieDBContext> dbContext) : DbContext(dbContext)
    {
        public DbSet<Movie> Movies { get; set; }
        public DbSet<Genre> Genres { get; set; }
        public DbSet<Movie_Genre> Movies_Genres { get; set; }

        protected override void OnModelCreating(ModelBuilder modelBuilder)
        {
            modelBuilder.Entity<Genre>().HasData(
                new Genre { Id = 1, Name = "Фентезі" },
                new Genre { Id = 2, Name = "Музичні" },
                new Genre { Id = 3, Name = "Мелодрами" },
                new Genre { Id = 4, Name = "Сімейний" },
                new Genre { Id = 5, Name = "Дитячий" },
                new Genre { Id = 6, Name = "Екшн" },
                new Genre { Id = 7, Name = "Комедія" },
                new Genre { Id = 8, Name = "Пригоди" }
            );

            modelBuilder.Entity<Movie>().HasData(
                new Movie
                {
                    Id = 1,
                    Title = "Чародійка",
                    Description =
                    "Ми переносимося в Країну Оз і знайомимося з відьмою на ім'я Ельфаба. Вона наділена не тільки надприродними здібностями, " +
                    "але й зеленим кольором шкіри. Через це з неї сміялися протягом усього дитинства, а тепер всі бояться Ельфаби. Відьма впевнена, " +
                    "що у світі немає жодної людини, якій варто було б довіряти. Життя головної героїні змінюється, коли вона опиняється в школі " +
                    "чаклунства. Тут Ельфаба знайомиться з Гліндою - чарівницею з добрим серцем, яка користується загальною любов'ю. Вона пропонує " +
                    "новенькій свою дружбу, що стає для всіх повною несподіванкою. В той самий час подруги дізнаються, що над їхнім світом нависла " +
                    "небезпека, яка походить від підступного чаклуна. Незважаючи на різні погляди, Ельфаба і Глінда об'єднують зусилля і вступають " +
                    "у боротьбу з темними силами.",
                    Year = 2024,
                    Rating = 7.6f
                },

                new Movie
                {
                    Id = 2,
                    Title = "Барбі",
                    Description =
                    "Барбіленд – напрочуд прекрасний світ. Його мешканці – ідеальні та вічно молоді. Вони мають спортивні фігури, красиві обличчя. " +
                    "Постійно виглядаючи як супермоделі, хлопці та дівчата одягаються у модний одяг. Гучні вечірки супроводжуються виключно сучасною музикою, " +
                    "а їхні учасники здатні танцювати всю ніч. Але варто придивитися, видно, що рухи надто механічні, а прагнення до ідеалу надто наполегливе. " +
                    "Барбі з Кеном усіляко намагалися відповідати стандартам. Але їхні спроби були марними, що призвело до кризи. У новому світі вона зрозуміла, " +
                    "що зовсім необов'язково прагнути недосяжних ідеалів, що можна просто залишатися собою. З якими викликами доведеться зіткнутися білявій " +
                    "красуні і чи зможе вона знайти нових друзів?",
                    Year = 2023,
                    Rating = 6.8f
                },

            new Movie
            {
                Id = 3,
                Title = "Школа монстрів: 13 бажань",
                Description =
                "Мультфільм «Школа монстрів: 13 бажань» продовжує розповідати про дивовижні пригоди учнів найнезвичайнішої школи у світі. " +
                "З початком нового навчального року юні монстри чекають на великі зміни у власних життях, адже новий рік обіцяє нові можливості. " +
                "Деякі бажання учнів дуже прості, а деякі є практично нездійсненними. " +
                "Так, юна Хоулін мріє стати найпопулярнішим дівчиськом у школі, але слава та популярність належить її старшій сестрі Клодін Вульф та її подругам. " +
                "Однак після того, як в руки Хоулін потрапляє чарівна лампа з джином усередині, її мрія починає збуватися. " +
                "Чарівний джин Джіджі дарує дівчинці можливість здійснити не одне, а цілих тринадцять бажань. " +
                "Щоправда, невдовзі Хоулін розуміє, що свої бажання потрібно обирати дуже ретельно.",
                Year = 2013,
                Rating = 6.9f
            },

            new Movie
            {
                Id = 4,
                Title = "Школа монстрів: Бу Йорк, Бу Йорк",
                Description =
                "Пригоди студентів незвичайного навчального закладу для монстрів продовжуються. " +
                "Талановита співачка на ім'я Кетті Нуар залишила світ шоу-бізнесу в розпал своєї популярності. " +
                "Дівчину залишило натхнення, тож вона не може писати нові пісні. " +
                "Взявши паузу у творчій кар'єрі, вона вирішила присвятити більше часу навчанню. " +
                "Одного дня разом зі своїми близькими приятельками, Нуар вирушає у величезне місто Бу-Йорк. " +
                "Цей населений пункт є справжнім центром музики, моди та театрів. Саме тут збираються талановиті особи." +
                " Кетті сподівається зарядитись позитивною енергією від перебування в мегаполісі. " +
                "Незабаром головних героїнь мультфільму «Школа Монстрів: Бу-Йорк, Бу-Йорк» чекають неймовірні зустрічі та пригоди.",
                Year = 2015,
                Rating = 6.7f
            },


                new Movie
                {
                    Id = 5,
                    Title = "Школа монстрів: Привиди",
                    Description =
                    "Незвичайний анімаційний мультфільм Школа монстрів: Привиди показує життя учениць, " +
                    "які навчаються у школі для нечисті. На них чекають неймовірні пригоди в таємничому місці для привидів. " +
                    "Маленькі дівчатка-монстри разом із куратором відвідують світ Духів, хоч за правилами це заборонено. " +
                    "Директор - жінка, що дотримуються вкрай строгих правил. " +
                    "Головній героїні мультика Спектрі буде важко повернутись, оскільки керівниця навчального закладу не випустить її. " +
                    "Доводиться подругам дівчини бігти на допомогу. Що з цього вийде і чи пощастить повернути полонянку глядачі дізнаються, подивившись мультфільм.",
                    Year = 2015,
                    Rating = 6.3f
                }
            );

            modelBuilder.Entity<Movie_Genre>().HasData(
                new Movie_Genre { Id = 1, MovieId = 1, GenreId = 1 },
                new Movie_Genre { Id = 2, MovieId = 1, GenreId = 2 },
                new Movie_Genre { Id = 3, MovieId = 1, GenreId = 3 },
                new Movie_Genre { Id = 4, MovieId = 2, GenreId = 3 },
                new Movie_Genre { Id = 5, MovieId = 2, GenreId = 6 },
                new Movie_Genre { Id = 6, MovieId = 2, GenreId = 7 },
                new Movie_Genre { Id = 7, MovieId = 2, GenreId = 8 },
                new Movie_Genre { Id = 8, MovieId = 3, GenreId = 1 },
                new Movie_Genre { Id = 9, MovieId = 3, GenreId = 5 },
                new Movie_Genre { Id = 10, MovieId = 3, GenreId = 7 },
                new Movie_Genre { Id = 11, MovieId = 4, GenreId = 2 },
                new Movie_Genre { Id = 12, MovieId = 4, GenreId = 5 },
                new Movie_Genre { Id = 13, MovieId = 4, GenreId = 8 },
                new Movie_Genre { Id = 14, MovieId = 5, GenreId = 1 },
                new Movie_Genre { Id = 15, MovieId = 5, GenreId = 4 },
                new Movie_Genre { Id = 16, MovieId = 5, GenreId = 5 }
            );

            base.OnModelCreating(modelBuilder);
        }
    }
}
